In [22]:
!pip install mysql

Requirement already satisfied: mysql in c:\users\23ady\anaconda3\lib\site-packages (0.0.3)
Requirement already satisfied: mysqlclient in c:\users\23ady\anaconda3\lib\site-packages (from mysql) (2.1.1)

In [23]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\23ady\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\23ady\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [2]:
import mysql.connector

In [3]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="AdyashaRout@08"
)
print(db)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001B6B180F670>

In [4]:
cur=db.cursor()

In [5]:
cur.execute("show databases")

In [6]:
for i in cur:
    print(i)

('adyashadb',)
('database1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [7]:
cur.execute("create database database1")

DatabaseError: 1007 (HY000): Can't create database 'database1'; database exists

In [8]:
cur.execute("show databases")
for i in cur:
    print(i)

('adyashadb',)
('database1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [9]:
db=mysql.connector.connect(
    host="localhost",
    user="root",
    password="AdyashaRout@08",
    database="database1",
)

In [10]:
cur=db.cursor()
cur.execute("create table school(gender varchar(6),student_id int(10),marks int(3))")

ProgrammingError: 1050 (42S01): Table 'school' already exists

In [11]:
cur.execute("show tables")
for i in cur:
    print(i)

('school',)

## Data insertion inside table

#### single data insertion

In [12]:
sql="insert into school (gender,student_id,marks) values('male',123456789,43)"
cur.execute(sql)
print(cur.rowcount,"recurd inserted")

1 recurd inserted

In [13]:
db.commit()

#### Multiple record insertion

In [14]:
sql="insert into school(gender,student_id,marks) values ('male',234567891,67),('female',345678912,52),('male',567891234,82),('male',78912345,66),('female',891234567,55),('female',912345678,63)"

In [15]:
cur.execute(sql)
print(cur.rowcount,'record inserted')

6 record inserted

In [16]:
db.commit()

#### Another way of inserting records

In [17]:
sql="insert into school (gender,student_id,marks) values(%s,%s,%s)"
val=(('male',24682465,79),('female',1357913,83),('male',13616356,58),('male',73464619,72))
cur.executemany(sql,val)
print(cur.rowcount,'record inserted')

4 record inserted

In [18]:
db.commit()

#### Data Selection

In [19]:
cur.execute('select * from school')
for i in cur:
    print(i)

('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 55)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 55)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)

 #### WHERE condition

In [34]:
sql="select distinct * from school where student_id =123456789"
myres=cur.execute(sql)
myres=cur.fetchall()
for i in myres:
    print(i)

('male', 123456789, 43)

In [35]:
cur=db.cursor()

In [36]:
sql="select * from school where gender ='male'"
res=cur.execute(sql)
res=cur.fetchall()

for i in res:
    print(i)

('male', 123456789, 43)
('male', 234567891, 67)
('male', 567891234, 82)
('male', 78912345, 66)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 123456789, 43)
('male', 234567891, 67)
('male', 567891234, 82)
('male', 78912345, 66)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)

In [37]:
sql ="select distinct * from school where student_id=345678912"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('female', 345678912, 52)

In [38]:
sql="select * from school order by marks desc"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('female', 1357913, 83)
('female', 1357913, 83)
('female', 1357913, 83)
('male', 567891234, 82)
('male', 567891234, 82)
('male', 24682465, 79)
('male', 24682465, 79)
('male', 24682465, 79)
('male', 73464619, 72)
('male', 73464619, 72)
('male', 73464619, 72)
('male', 234567891, 67)
('male', 234567891, 67)
('male', 78912345, 66)
('male', 78912345, 66)
('female', 912345678, 63)
('female', 912345678, 63)
('male', 13616356, 58)
('male', 13616356, 58)
('male', 13616356, 58)
('female', 891234567, 55)
('female', 891234567, 55)
('female', 345678912, 52)
('female', 345678912, 52)
('male', 123456789, 43)
('male', 123456789, 43)

In [40]:
sql="select * from school order by student_id desc"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('female', 912345678, 63)
('female', 912345678, 63)
('female', 891234567, 55)
('female', 891234567, 55)
('male', 567891234, 82)
('male', 567891234, 82)
('female', 345678912, 52)
('female', 345678912, 52)
('male', 234567891, 67)
('male', 234567891, 67)
('male', 123456789, 43)
('male', 123456789, 43)
('male', 78912345, 66)
('male', 78912345, 66)
('male', 73464619, 72)
('male', 73464619, 72)
('male', 73464619, 72)
('male', 24682465, 79)
('male', 24682465, 79)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 13616356, 58)
('male', 13616356, 58)
('female', 1357913, 83)
('female', 1357913, 83)
('female', 1357913, 83)

In [41]:
sql="select * from school order by gender"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('female', 345678912, 52)
('female', 891234567, 55)
('female', 912345678, 63)
('female', 1357913, 83)
('female', 1357913, 83)
('female', 345678912, 52)
('female', 891234567, 55)
('female', 912345678, 63)
('female', 1357913, 83)
('male', 123456789, 43)
('male', 234567891, 67)
('male', 567891234, 82)
('male', 78912345, 66)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 123456789, 43)
('male', 234567891, 67)
('male', 567891234, 82)
('male', 78912345, 66)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)

#### GROUP BY

In [43]:
sql="select count(student_id),gender from school group by gender"
cur.execute(sql)
res=cur.fetchall()
for x in res:
    print(x)

(17, 'male')
(9, 'female')

In [44]:
sql="select sum(marks),gender from school group by gender"
cur.execute(sql)
res=cur.fetchall()
for x in res:
    print(x)

(Decimal('1143'), 'male')
(Decimal('589'), 'female')

In [45]:
sql="select avg(marks),gender from school group by gender"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

(Decimal('67.2353'), 'male')
(Decimal('65.4444'), 'female')

#### HAVING CLAUSE

In [46]:
sql="select count(gender),avg(marks),gender from school group by gender having count(gender)>8"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

(17, Decimal('67.2353'), 'male')
(9, Decimal('65.4444'), 'female')

#### update table

In [50]:
sql="update school set marks =100 where student_id=891234567"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

In [51]:
db.commit()

In [52]:
print(cur.rowcount,"records updated")

2 records updated

In [54]:
sql="select * from school"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)

#### limit

it accepcts 1 or 2 arguments the values of both argument must be zero or positive integer

In [58]:
sql="select * from school limit 6"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)

In [60]:
sql="select * from school limit 6,7"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('female', 1357913, 83)

#### OPERTORS

#### IN
IN operator to determine if a specified value matches any value in a list or sub query

In [13]:
sql="select * from school where marks in(62,82,77,45)"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 567891234, 82)
('male', 567891234, 82)

#### BETWEEN

In [16]:
sql="select * from school where marks between 50 and 80"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 234567891, 67)
('female', 345678912, 52)
('male', 78912345, 66)
('female', 912345678, 63)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 78912345, 66)
('female', 912345678, 63)
('male', 24682465, 79)
('male', 13616356, 58)
('male', 73464619, 72)

#### LIKE
like operator to query data on a specified pattern

In [17]:
sql= "select * from school where marks like '7%'"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 24682465, 79)
('male', 73464619, 72)
('male', 24682465, 79)
('male', 73464619, 72)
('male', 24682465, 79)
('male', 73464619, 72)

In [18]:
sql="select * from school where marks like '%3'"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 123456789, 43)
('female', 912345678, 63)
('female', 1357913, 83)
('female', 1357913, 83)
('male', 123456789, 43)
('female', 912345678, 63)
('female', 1357913, 83)

#### Comparision Operator
Equal to '='
Greater Than '>'
Less than '<'
Greater than equal to '>='
Less than equal to '<='
Not equal to '!='

In [20]:
sql= "select * from school where marks=67"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 234567891, 67)
('male', 234567891, 67)

In [21]:
sql="select * from school where marks >= 77"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 567891234, 82)
('female', 891234567, 100)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 567891234, 82)
('female', 891234567, 100)
('male', 24682465, 79)
('female', 1357913, 83)

In [22]:
sql="select * from school where marks<>50"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)

#### Logical Operators

AND

OR 

NOT NULL

In [24]:
#AND operator to combine multiple boolean operator to filter data

sql="select * from school where gender = 'female' and marks >68"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('female', 891234567, 100)
('female', 1357913, 83)
('female', 1357913, 83)
('female', 891234567, 100)
('female', 1357913, 83)

In [27]:
sql="select * from school where gender ='male' and marks >=82 and student_id > 789123456"
cur.execute(sql)
cur.fetchall()

[]

In [28]:
# or operator is used to combine boolean opoeration for filtering ddata
sql="select * from school where gender ='male' and marks >=82 or student_id > 789123456"
cur.execute(sql)
cur.fetchall()

[('male', 567891234, 82),
 ('female', 891234567, 100),
 ('female', 912345678, 63),
 ('male', 567891234, 82),
 ('female', 891234567, 100),
 ('female', 912345678, 63)]

In [29]:
sql="select * from school where gender ='male' or marks >=82 or student_id > 789123456"
cur.execute(sql)
cur.fetchall()

[('male', 123456789, 43),
 ('male', 234567891, 67),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 100),
 ('female', 912345678, 63),
 ('male', 24682465, 79),
 ('female', 1357913, 83),
 ('male', 13616356, 58),
 ('male', 73464619, 72),
 ('male', 24682465, 79),
 ('female', 1357913, 83),
 ('male', 13616356, 58),
 ('male', 73464619, 72),
 ('male', 123456789, 43),
 ('male', 234567891, 67),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 100),
 ('female', 912345678, 63),
 ('male', 24682465, 79),
 ('female', 1357913, 83),
 ('male', 13616356, 58),
 ('male', 73464619, 72)]

In [30]:
# not null is to filter data on checking null
sql="select * from school where marks is not null"
cur.execute(sql)
res=cur.fetchall()
for i in res:
    print(i)

('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)
('male', 123456789, 43)
('male', 234567891, 67)
('female', 345678912, 52)
('male', 567891234, 82)
('male', 78912345, 66)
('female', 891234567, 100)
('female', 912345678, 63)
('male', 24682465, 79)
('female', 1357913, 83)
('male', 13616356, 58)
('male', 73464619, 72)

#### Aggrigate Functions
COUNT
MIN
MAX
AVG
SUM

In [31]:
sql="select count(student_id) from school "
cur.execute(sql)
cur.fetchall()

[(26,)]

In [33]:
sql="select min(marks) from school"
cur.execute(sql)
cur.fetchall()

[(43,)]

In [34]:
sql="select max(marks) from school"
cur.execute(sql)
cur.fetchall()

[(100,)]

In [37]:
sql="select avg(marks) from school"
cur.execute(sql)
cur.fetchall()

[(Decimal('70.0769'),)]

In [38]:
sql="select sum(marks) from school"
cur.execute(sql)
cur.fetchall()

[(Decimal('1822'),)]

In [42]:
sql="select count(gender), avg(marks) from school"
cur.execute(sql)
cur.fetchall()

[(26, Decimal('70.0769'))]

In [45]:
sql="select sum(marks) from school where gender='female' "
cur.execute(sql)
cur.fetchall()

[(Decimal('679'),)]

In [46]:
sql="select sum(marks) from school where gender='male'"
cur.execute(sql)
cur.fetchall()

[(Decimal('1143'),)]

In [47]:
sql="select max(marks) from school where gender='male'"
cur.execute(sql)
cur.fetchall()

[(82,)]

In [48]:
sql="select max(marks) from school where gender = 'female' "
cur.execute(sql)
cur.fetchall()

[(100,)]

#### JOINS
Used to join two or more tables

In [49]:
cur.execute('show tables')
cur.fetchall()

[('school',)]

In [50]:
cur.execute('create table marks (name varchar(10),student_id int(10),score int(3))')
cur.fetchall()

[]

In [51]:
db.commit()

In [53]:
cur.execute("insert into marks values('Alia',345678912,47),('Tarun',678912345,63),('Frankie',456789123,73),('Kanak',891234567,46),('Yashika',234567891,74)")
cur.fetchall()
db.commit()

In [54]:
cur.execute("select * from school")
cur.fetchall()

[('male', 123456789, 43),
 ('male', 234567891, 67),
 ('female', 345678912, 52),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 100),
 ('female', 912345678, 63),
 ('male', 24682465, 79),
 ('female', 1357913, 83),
 ('male', 13616356, 58),
 ('male', 73464619, 72),
 ('male', 24682465, 79),
 ('female', 1357913, 83),
 ('male', 13616356, 58),
 ('male', 73464619, 72),
 ('male', 123456789, 43),
 ('male', 234567891, 67),
 ('female', 345678912, 52),
 ('male', 567891234, 82),
 ('male', 78912345, 66),
 ('female', 891234567, 100),
 ('female', 912345678, 63),
 ('male', 24682465, 79),
 ('female', 1357913, 83),
 ('male', 13616356, 58),
 ('male', 73464619, 72)]

In [55]:
cur.execute("select * from marks")
cur.fetchall()

[('Alia', 345678912, 47),
 ('Tarun', 678912345, 63),
 ('Frankie', 456789123, 73),
 ('Kanak', 891234567, 46),
 ('Yashika', 234567891, 74),
 ('Alia', 345678912, 47),
 ('Tarun', 678912345, 63),
 ('Frankie', 456789123, 73),
 ('Kanak', 891234567, 46),
 ('Yashika', 234567891, 74)]

In [58]:
#Inner join matches each row in one table with every row in other table and allows you to query
sql="select school.student_id,school.gender,marks.name,marks.score from school inner join marks on school.student_id = marks.student_id"
cur.execute(sql)
cur.fetchall()

[(234567891, 'male', 'Yashika', 74),
 (234567891, 'male', 'Yashika', 74),
 (345678912, 'female', 'Alia', 47),
 (345678912, 'female', 'Alia', 47),
 (891234567, 'female', 'Kanak', 46),
 (891234567, 'female', 'Kanak', 46),
 (234567891, 'male', 'Yashika', 74),
 (234567891, 'male', 'Yashika', 74),
 (345678912, 'female', 'Alia', 47),
 (345678912, 'female', 'Alia', 47),
 (891234567, 'female', 'Kanak', 46),
 (891234567, 'female', 'Kanak', 46)]

In [59]:
# Right join will return matching and non matching with name
sql="select school.student_id,school.gender,marks.name,marks.score from school right join marks on school.student_id = marks.student_id"
cur.execute(sql)
cur.fetchall()

[(345678912, 'female', 'Alia', 47),
 (345678912, 'female', 'Alia', 47),
 (None, None, 'Tarun', 63),
 (None, None, 'Frankie', 73),
 (891234567, 'female', 'Kanak', 46),
 (891234567, 'female', 'Kanak', 46),
 (234567891, 'male', 'Yashika', 74),
 (234567891, 'male', 'Yashika', 74),
 (345678912, 'female', 'Alia', 47),
 (345678912, 'female', 'Alia', 47),
 (None, None, 'Tarun', 63),
 (None, None, 'Frankie', 73),
 (891234567, 'female', 'Kanak', 46),
 (891234567, 'female', 'Kanak', 46),
 (234567891, 'male', 'Yashika', 74),
 (234567891, 'male', 'Yashika', 74)]

In [60]:
#Left Join It selects data starting from the left table .It matches each row from the left table with every row from the right table based on the join condition
sql="select school.student_id,school.gender,marks.name,marks.score from school left join marks on school.student_id = marks.student_id"
cur.execute(sql)
cur.fetchall()

[(123456789, 'male', None, None),
 (234567891, 'male', 'Yashika', 74),
 (234567891, 'male', 'Yashika', 74),
 (345678912, 'female', 'Alia', 47),
 (345678912, 'female', 'Alia', 47),
 (567891234, 'male', None, None),
 (78912345, 'male', None, None),
 (891234567, 'female', 'Kanak', 46),
 (891234567, 'female', 'Kanak', 46),
 (912345678, 'female', None, None),
 (24682465, 'male', None, None),
 (1357913, 'female', None, None),
 (13616356, 'male', None, None),
 (73464619, 'male', None, None),
 (24682465, 'male', None, None),
 (1357913, 'female', None, None),
 (13616356, 'male', None, None),
 (73464619, 'male', None, None),
 (123456789, 'male', None, None),
 (234567891, 'male', 'Yashika', 74),
 (234567891, 'male', 'Yashika', 74),
 (345678912, 'female', 'Alia', 47),
 (345678912, 'female', 'Alia', 47),
 (567891234, 'male', None, None),
 (78912345, 'male', None, None),
 (891234567, 'female', 'Kanak', 46),
 (891234567, 'female', 'Kanak', 46),
 (912345678, 'female', None, None),
 (24682465, 'male', None, None),
 (1357913, 'female', None, None),
 (13616356, 'male', None, None),
 (73464619, 'male', None, None)]

#### PRIMARY KEY FOREIGN KEY

#### SUB QUERY AND NESTED QUERY

In [63]:
sql="select student_id, gender from school where student_id in(select student_id from marks where marks >50)"
cur.execute(sql)
cur.fetchall()

[(234567891, 'male'),
 (345678912, 'female'),
 (891234567, 'female'),
 (234567891, 'male'),
 (345678912, 'female'),
 (891234567, 'female')]